using System;
namespace Lab_2.Classes.Tasks
{
    class Task__3_10 : BaseInit_TwoDim, IRunnable
    {
        public Task__3_10() :
            base ("Перетворити матрицю A, кількість елементів у кожному рядку " +
                "якої є різною, на одновимірний масив V наступним чином: " +
                "для кожного елемента матриці в одновимірний масив записуються " +
                "спочатку його індекси, а потім – значення. " +
                "Інвертувати порядок елементів масиву V та відновити на його " +
                "основі прямокутну матрицю B за зворотним принципом.") { }

        public void Run()
        {
            throw new NotImplementedException();
        }
    }
}
